/* Title of autogenerated main event calendar */
AUTOGENERATED_MAIN_EVENT_CALENDAR_TITLE = "Calendar";

/* Title of autogenerated main contacts store */
AUTOGENERATED_MAIN_CONTACTS_TITLE = "Contacts";

/* For invite emails: subject prefix for Accepting (we should match Outlook and friends on these localizations) */
MEETING_RESPONSE_ACCEPTED = "Accepted:";

/* For invite emails: subject prefix for Declining (we should match Outlook and friends on these localizations) */
MEETING_RESPONSE_DECLINED = "Declined:";

/* For invite emails: subject prefix for Tentatively Accepting (we should match Outlook and friends on these localizations) */
MEETING_RESPONSE_TENTATIVE = "Tentative:";

/* Header of the alert presented when the exchange server certificate could not be verified  */
SERVER_CERTIFICATE_ERROR_ALERT_HEADER = "Unable to Verify Certificate";

/* Alert body when a server certificate is issued by an unknown root */
SERVER_CERTIFICATE_UNVERIFIED_WITH_ACCOUNT_DESCRIPTION = "The certificate from “%@” for account “%@” could not be verified.";

/* Alert body when a server certificate is issued by an unknown root for an account with no description */
SERVER_CERTIFICATE_UNVERIFIED = "The certificate from “%@” could not be verified.";

/* Alert body when an autodiscovery server has an unverified certificate */
SERVER_CERTIFICATE_UNVERIFIED_AUTODISCOVERY = "While automatically discovering account settings, the certificate from “%@” could not be verified.";

/* Title of the button to accept an unverified server certificate */
SERVER_CERTIFICATE_ACCEPT = "Accept";

/* Title of the button to cancel an unverified server certificate */
SERVER_CERTIFICATE_CANCEL = "Cancel";

/* Title of the invalid password dialog */
INVALID_PASSWORD_HEADER = "Password Incorrect";

/* Title of the missing password dialog */
MISSING_PASSWORD_HEADER = "Password Required";

/* Content of the invalid password dialog */
INVALID_PASSWORD_BODY_EXCHANGE = "Enter the password for the Exchange account “%@”";
INVALID_PASSWORD_BODY_HOTMAIL  = "Enter the password for the Hotmail account “%@”";
INVALID_PASSWORD_BODY_LDAP     = "Enter the password for the LDAP account “%@”";
INVALID_PASSWORD_BODY_CALDAV   = "Enter the password for the CalDAV account “%@”";
INVALID_PASSWORD_BODY_CARDDAV  = "Enter the password for the CardDAV account “%@”";
INVALID_PASSWORD_BODY_SUBCAL   = "Enter the password for the Subscribed Calendar “%@”";

/* These are passed into ManagedConfiguration.  The first is put into a string like:
"the account “%@” can't do something until you set a passcode".  Here's a sample expansion:
Policy Requirement
The account “MyExchangeAccount” can't do something until you set a passcode
[Disable]
*/
DA_POLICY_COMPLIANCE_WARNING = "The account “%@” cannot receive new data until a new passcode is set.";
DA_POLICY_FAILURE_TITLE = "Policy Requirement";
DA_POLICY_FAILURE_BUTTON_TITLE = "Disable";

/* Text inside the password entry field */
INVALID_PASSWORD_PLACEHOLDER = "Password";

/* Title of the button to accept a password */
PASSWORD_OK = "OK";

/* Title of the button to cancel password entry */
PASSWORD_CANCEL = "Cancel";

/* Text inside the username entry field */
INVALID_USERNAME_PLACEHOLDER = "Username";

/* Title of the invalid client certificate dialog */
INVALID_CLIENT_CERTIFICATE_HEADER = "Cannot Authenticate";

/* Content of the invalid client certificate dialog */
INVALID_CLIENT_CERTIFICATE_BODY = "Cannot authenticate to the server “%@” because the certificate is not valid.";

/* Acknowledgement of alert */
INVALID_CLIENT_CERTIFICATE_OK = "OK";

ACCOUNT_UNIQUE_CONSTRAINT_FAILED_TITLE = "Cannot Create Account";

ACCOUNT_UNIQUE_CONSTRAINT_FAILED_BODY_FORMAT_EXCHANGE = "An identical Exchange account already exists.";
ACCOUNT_UNIQUE_CONSTRAINT_FAILED_BODY_FORMAT_HOTMAIL  = "An identical Hotmail account already exists.";
ACCOUNT_UNIQUE_CONSTRAINT_FAILED_BODY_FORMAT_LDAP     = "An identical LDAP account already exists.";
ACCOUNT_UNIQUE_CONSTRAINT_FAILED_BODY_FORMAT_CALDAV   = "An identical CalDAV account already exists.";
ACCOUNT_UNIQUE_CONSTRAINT_FAILED_BODY_FORMAT_CARDDAV  = "An identical CardDAV account already exists.";
ACCOUNT_UNIQUE_CONSTRAINT_FAILED_BODY_FORMAT_SUBCAL   = "An identical Subscribed Calendar account already exists.";

/**** Subscribed Calendar Setup ****/
/* Alert Strings */
"VALIDATED_ALERT_TITLE_FORMAT" = "Subscribe to the calendar “%@”?";
"AUTH_NEEDED_ALERT_TITLE_FORMAT" = "Calendar at %@ requires authentication";
"INVALID_ALERT_TITLE" = "Cannot Subscribe";
"INVALID_ALERT_MESSAGE_FORMAT" = "Could not subscribe to the calendar “%@” from “%@”.";
"WHERE_TO_ALERT_TITLE_FORMAT" = "The Calendar “%@” has been added";
"ELLIPSIS" = "…";

/* Authentication needed for a specific calendar that already has a name */
"AUTH_NEEDED_SPECIFIC_ALERT_TITLE_FORMAT" = "Calendar “%@” at %@ requires authentication";

/* Button titles */
"CANCEL" = "Cancel";
"SUBSCRIBE" = "Subscribe";

"OK" = "OK";
"VIEW_EVENTS" = "View Events";
"EDIT_SETTINGS" = "Edit Settings";
"DONE" = "Done";

/* Meeting response server failure dialog */
MEETING_RESPONSE_FAILURE_TITLE = "Calendar Invitation";
MEETING_RESPONSE_FAILURE_BODY = "Your response to the invitation cannot be sent.";


